module.exports = {
    isBlankChar: function (c)// 是空白字符
    {
        return (c == '\0' || c == ' ' || c == '\t' || c == '\n' || c == '\r' || c == '\f');
    },
    isSeparator: function (c)// 是分隔符
    {
        return (isBlankChar(c) || c == '=' ||
            c == '+' || c == '-' || c == '*' || c == '/' || c == '%' ||
            c == '!' || c == '&' || c == '|' || c == '^' || c == '~' ||
            c == '?' || c == ':' || c == ';' || c == '{' || c == '}' ||
            c == '(' || c == ')' || c == '[' || c == ']' || c == '#' ||
            c == '<' || c == '>' || c == '\'' || c == '\"' || c == '\\' ||
            c == ',' || c == '.' || c == '`' || c == '@');
    }
}